# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name tsmc16adfp_ls -timing {/ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellff0p88v125c_ccs.lib /ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellff0p88vm40c_ccs.lib /ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellss0p72v125c_ccs.lib /ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellss0p72vm40c_ccs.lib /ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCelltt0p8v25c_ccs.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ff0p88v0p88v125c_100a.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ff0p88v0p88vm40c_100a.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ss0p72v0p72v125c_100a.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ss0p72v0p72vm40c_100a.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_tt0p8v0p8v25c_100a.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOff0p88v1p98v125c.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOff0p88v1p98vm40c.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOss0p72v1p62v125c.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOss0p72v1p62vm40c.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOtt0p8v1p8v25c.lib}
create_constraint_mode -name test_cm -sdc_files {../syn/outputs/picorv32_axi.sdc}
create_delay_corner -name tsmc16adfp_dc -library_set {tsmc16adfp_ls}
create_analysis_view -name test_av -constraint_mode {test_cm} -delay_corner {tsmc16adfp_dc}
set_analysis_view -setup {test_av} -hold {test_av}
