# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name best_case -cap_table {/ip/tsmc/tsmc16adfp/tech/RC/N16ADFP_QRC/best/qrcTechFile} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_rc_corner -name worst_case -cap_table {/ip/tsmc/tsmc16adfp/tech/RC/N16ADFP_QRC/worst/qrcTechFile} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_library_set -name fast_case -timing {/ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellff0p88vm40c_ccs.lib /ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ff0p88v0p88vm40c_100a.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOff0p88v1p98vm40c.lib /ip/tsmc/tsmc16adfp/pll/LIB/n16adfp_pllff0p88v1p98vm40c.lib}
create_library_set -name slow_case -timing {/ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_ss0p72v0p72v125c_100a.lib /ip/tsmc/tsmc16adfp/stdcell/CCS/N16ADFP_StdCellss0p72v125c_ccs.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOss0p72v1p62v125c.lib /ip/tsmc/tsmc16adfp/pll/LIB/n16adfp_pllss0p72v1p62v125c.lib}
create_library_set -name typical_case -timing {/ip/tsmc/tsmc16adfp/sram/NLDM/N16ADFP_SRAM_tt0p8v0p8v25c_100a.lib /ip/tsmc/tsmc16adfp/stdcell/NLDM/N16ADFP_StdCelltt0p8v25c.lib /ip/tsmc/tsmc16adfp/stdio/NLDM/N16ADFP_StdIOtt0p8v1p8v25c.lib /ip/tsmc/tsmc16adfp/pll/LIB/n16adfp_plltt0p8v1p8v25c.lib}
create_constraint_mode -name const_mode -sdc_files {syn/outputs/output_Nov16/mux4to1.sdc}
create_delay_corner -name early_case -library_set {fast_case} -rc_corner {best_case}
create_delay_corner -name late_case -library_set {typical_case} -rc_corner {worst_case}
create_analysis_view -name hold_case -constraint_mode {const_mode} -delay_corner {early_case}
create_analysis_view -name setup_case -constraint_mode {const_mode} -delay_corner {late_case}
set_analysis_view -setup {setup_case} -hold {hold_case}
